app/controllers/albums_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."album_id" = ?  [["album_id", "U295IFBlb3I="]]
DELETE FROM "songs" WHERE "songs"."id" = ?  [["id", "QWRlbWFzIGRlIG1pIHJlbWl4"]]
---
  def delete
    track = Song.find_by id: params[:id]
    if track.present?
      track.destroy