app/controllers/artists_controller.rb

SELECT "artists"."id" FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", ""], ["LIMIT", 1]]
INSERT INTO "albums" ("id", "artist_id", "name", "genre", "artist_album", "tracks_album", "self_album", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "artists" ("id", "name", "age", "albums_artist", "tracks_artist", "self_artst", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create_artist


    if params[:name].blank? || params[:age].blank?

      return render json: [], status: 400
    else

      name_artist = params[:name].strip
      age_artist = params[:age].to_i
      id_artist= Base64.encode64(name_artist).strip[0..21]
      artistas = Artist.all.ids

      if artistas.include?(id_artist)
        render json: Artist.find(id_artist), status: 409
      else
        artist = Artist.new
        artist.name = name_artist
        artist.id = id_artist
        artist.age = age_artist
        artist.self_artst = "https://dbcaldet2.herokuapp.com/artists/" + id_artist
        artist.tracks_artist = "https://dbcaldet2.herokuapp.com/artists/" + id_artist + "/tracks"
        artist.albums_artist = "https://dbcaldet2.herokuapp.com/artists/" + id_artist + "/albums"
        if artist.save

SELECT "artists".* FROM "artists"
---
  def index
    artists = Artist.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", "VHJ1ZW5v"], ["LIMIT", 1]]
---
  def show
    artista = Artist.find(params[:id])

SELECT "artists".* FROM "artists"
SELECT "artists"."id" FROM "artists"
SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = ?  [["artist_id", "QmFkIEJ1bm55"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", "QmFkIEJ1bm55"], ["LIMIT", 1]]
---
  def play
    artistas = Artist.all.ids
    if artistas.include?(params[:id])
      albums = Artist.find(params[:id]).albums

SELECT "artists"."id" FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", "QmFkIEJ1bm55"], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", "QmFkIEJ1bm55"]]
---
  def delete
    artistas = Artist.all.ids
    if artistas.include?(params[:id])
      artist_delete = Artist.find(params[:id])
      artist_delete.destroy